tests/pyreverse/data/classes_plantuml.puml
@startuml classes_plantuml
set namespaceSeparator none
class "Ancestor" as data.clientmodule_test.Ancestor {
attr : str
cls_member
get_value()
set_value(value)
}
class "DoNothing" as data.suppliermodule_test.DoNothing {

}
class "Interface" as data.suppliermodule_test.Interface {
get_value()
set_value(value)
}
class "Specialization" as data.clientmodule_test.Specialization {
TYPE : str
relation
top : str
}
data.clientmodule_test.Specialization --|> data.clientmodule_test.Ancestor
data.clientmodule_test.Ancestor ..|> data.suppliermodule_test.Interface
data.suppliermodule_test.DoNothing --* data.clientmodule_test.Ancestor : cls_member
data.suppliermodule_test.DoNothing --* data.clientmodule_test.Specialization : relation
@enduml
